Revit 2016 API
CustomExporter Properties
The CustomExporter type exposes the following members.
Properties
Name | Description
IncludeFaces |  Obsolete.
 This flag sets the exporter to either include or exclude notifications about faces being processed in the export context.
IncludeGeometricObjects
 This flag sets the exporter to either include or exclude output of geometric objects such as faces and curves when the model is being processed by the export context.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShouldStopOnError
 This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods.
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace